# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'bat'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'git', args: ['with-iri']
brew 'mackup'
brew 'mas'
brew 'pkg-config'
brew 'trash'
brew 'tree'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'wget'

# Development
brew 'php'
brew 'mariadb'
brew 'node'
brew 'rbenv'

# Apps
cask 'alfred'
cask 'cyberduck'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'grammarly'
cask 'iterm2'
cask 'kap'
cask 'karabiner-elements'
cask 'macdown'
cask 'macpass'
cask 'phpstorm'
cask 'postman'
cask 'sequel-pro-nightly'
cask 'shuttle'
cask 'spectacle'
cask 'sublime-text'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 1333542190
mas 'Airmail 3', id: 918858936
mas 'Giphy Capture', id: 668208984
mas 'The Unarchiver', id: 425424353
