# Taps
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'azure-cli'
brew 'awscli'
brew 'bat'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'git'
brew 'mackup'
brew 'mas'
brew 'nvm'
brew 'pkg-config'
brew 'rbenv'
brew 'trash'
brew 'tree'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'wget'

# Apps
cask 'alfred'
cask 'cyberduck'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'kap'
cask 'karabiner-elements'
cask 'macdown'
cask 'macpass'
cask 'notion'
cask 'postman'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# Install Mac App Store apps
mas '1Password', id: 1333542190
mas 'Airmail 3', id: 918858936
mas 'Easy CSV Editor', id: 1171346381
mas 'The Unarchiver', id: 425424353
mas 'Todoist: To-Do List & Tasks', id: 585829637
mas 'ColorSlurp', id: 1287239339